clear all;
clc;

pw1=0.6;%先验概率
pw2=0.4;

%样本集
x1=[0.23 1.52 0.65 0.77 1.05 1.19 0.29 0.25 0.66 0.56 0.90 0.13 -0.54 0.94 -0.21 0.05 -0.08 0.73 0.33 1.06 -0.02 0.11 0.31 0.66];
y1=[2.34 2.19 1.67 1.63 1.78 2.01 2.06 2.12 2.47 1.51 1.96 1.83 1.87 2.29 1.77 2.39 1.56 1.93 2.20 2.45 1.75 1.69 2.48 1.72];
w1=[x1',y1'];

x2=[1.40 1.23 2.08 1.16 1.37 1.18 1.76 1.97 2.41 2.58 2.84 1.95 1.25 1.28 1.26 2.01 2.18 1.79 1.33 1.15 1.70 1.59 2.93 1.46];
y2=[1.02 0.96 0.91 1.49 0.82 0.93 1.14 1.06 0.81 1.28 1.46 1.43 0.71 1.29 1.37 0.93 1.22 1.18 0.87 0.55 0.51 0.99 0.91 0.71];
w2=[x2',y2'];

%均值向量
m1=mean(w1);
m2=mean(w2);

%计算类内离散度
[row1,colum1]=size(w1); 
s1=zeros(2);
for i=1:row1
    s1=s1+[-m1(1)+x1(i) -m1(2)+y1(i)]'*[-m1(1)+x1(i) -m1(2)+y1(i)];
end

[row2,colum2]=size(w2); 
s2=zeros(2);
for i=1:row2
    s2=s2+[-m2(1)+x2(i) -m2(2)+y2(i) ]'*[-m2(1)+x2(i) -m2(2)+y2(i) ];
end

sw=s1+s2;%总类内离散度

sb=(m1-m2)'*(m1-m2);%类间离散度

sw1=inv(sw);%sw的逆矩阵

w=sw1*(m1-m2)';

w=w/sqrt(sum(w.^2));%转为单位向量方便后续计算
%w.shape->(2,1)

%计算一维Y空间中的各类样本均值M1及M2
for i=1:24
    y(i)=w'*w1(i,:)';
end
M1=mean(y);
for i=1:24
    y(i)=w'*w2(i,:)';
end
M2=mean(y);

W0=-(M1+M2)/2-(log(pw2/pw1))/(24+24-2);%计算阈值估计值（考虑先验概率）


%待分类数据
x=[1 1.2 2.0 1.2 0.23];
y=[1.5 1.0 0.9 1.5 2.33];
Sample=[x',y'];
[row3,colum3]=size(Sample); 


%判别
result=0;
type=[0 0 0 0 0];%存放分类输出结果
for i=1:row3
    
    result=w'*Sample(i,:)'+W0;%一维空间线性决策规则g(x)=w'x+w0>0 (x->w1)
    
    if result>0
        type(i)=1;
    else
        type(i)=0;
    end
end
type
W0
%绘图
finalw=3*w;%为了美观适当加长投影方向
figure;
plot(x1,y1,'*',x2,y2,'r>');%绘制样本集
hold on;
line([-finalw(1),finalw(1)],[-finalw(2),finalw(2)],'color','g');%绘制投影方向
hold on;
plot(x,y,'o')%绘制测试集

for i=1:row3
    MM=Sample(i,:)*w*w';%投影点坐标=原二维坐标*单位向量.shape(2,1)*单位向量.shape(1,2)
   
    hold on;
    plot(MM(1),MM(2),'bp');%绘制投影点
end

%计算并绘制分类面
cxm=[];
cxk=-w(1)/w(2);
cxm(1)=(-W0-1.5*w(2))/w(1);
cxm(2)=1.5;
cxc=cxm(2)-cxk*cxm(1);
cxx=-1:0.01:2;
cxy=cxk*cxx+cxc;
hold on;
plot(cxx,cxy,'r');
xlim([-3,3]);
ylim([-3,3]);
hold on;
axis square;%改变坐标系为正方形，方便看结果



